package org.example.task4;

public class Test {
    public static void main(String[] args) {
        //Завдання 4:
        //Створіть клас Проектор. Він має містити інформацію про назву проектора, рік випуску, ціна, виробник.
        //Потрібно створити набір проекторів і виконати наступні завдання:
        // Вивести всі проектори
        // Вивести всі проектори одного виробника
        // Вивести всі проектори поточного року
        // Вивести всі проектори вище вказаної ціни
        // Вивести всі проектори, відсортувати по ціна зростання
        // Вивести всі проектори, відсортувати по ціні спадання
        // Вивести всі проектори, відсортувати по року випуску по зростанню
        // Вивести всі проектори, відсортувати по року випуску по спаданню
        ProjectorDemo projectorDemo = new ProjectorDemo();
        String specifiedManufacturer = "Sony";
        double specifiedPrice = 600.0;

        projectorDemo.getProjectorsFunctions(specifiedManufacturer, specifiedPrice);
    }
}
